CREATE TABLE student_parent (
    id BIGINT PRIMARY KEY AUTO_INCREMENT,

    student_id BIGINT NOT NULL,            -- 外键
    relation VARCHAR(20) NOT NULL,         -- 父亲/母亲/监护人
    name VARCHAR(50),                      -- 家长姓名
    phone VARCHAR(20) NOT NULL,            -- 手机号
    is_primary TINYINT DEFAULT 0,          -- 是否主联系人
    sms_enabled TINYINT DEFAULT 1,         -- 是否启用短信
    status TINYINT DEFAULT 1,              -- 1有效 0停用

    created_at DATETIME(3) DEFAULT CURRENT_TIMESTAMP(3),

    UNIQUE KEY uk_phone (phone),
    INDEX idx_student (student_id),

    FOREIGN KEY (student_id) REFERENCES student(id)
);



--- 插入家长数据
INSERT INTO student_parent
(student_id, relation, name, phone, is_primary, sms_enabled)
VALUES
-- 1
(1, '父亲', '陈建国', '13800010001', 1, 1),
(1, '母亲', '李红梅', '13800010002', 0, 1),

-- 2
(2, '父亲', '林志强', '13800010003', 1, 1),
(2, '母亲', '王丽娟', '13800010004', 0, 1),

-- 3
(3, '父亲', '张伟', '13800010005', 1, 1),
(3, '母亲', '刘芳', '13800010006', 0, 1),

-- 4
(4, '父亲', '李军', '13800010007', 1, 1),
(4, '母亲', '赵敏', '13800010008', 0, 1),

-- 5
(5, '父亲', '王强', '13800010009', 1, 1),
(5, '母亲', '孙静', '13800010010', 0, 1),

-- 6
(6, '父亲', '刘波', '13800010011', 1, 1),
(6, '母亲', '周燕', '13800010012', 0, 1),

-- 7
(7, '父亲', '赵磊', '13800010013', 1, 1),
(7, '母亲', '吴芳', '13800010014', 0, 1),

-- 8
(8, '父亲', '黄涛', '13800010015', 1, 1),
(8, '母亲', '陈丽', '13800010016', 0, 1),

-- 9
(9, '父亲', '周凯', '13800010017', 1, 1),
(9, '母亲', '杨雪', '13800010018', 0, 1),

-- 10
(10, '父亲', '吴刚', '13800010019', 1, 1),
(10, '母亲', '徐梅', '13800010020', 0, 1),

-- 11
(11, '父亲', '徐强', '13800010021', 1, 1),
(11, '母亲', '李娜', '13800010022', 0, 1),

-- 12
(12, '父亲', '孙磊', '13800010023', 1, 1),
(12, '母亲', '郑敏', '13800010024', 0, 1),

-- 13
(13, '父亲', '朱建华', '13800010025', 1, 1),
(13, '母亲', '何莉', '13800010026', 0, 1),

-- 14
(14, '父亲', '胡军', '13800010027', 1, 1),
(14, '母亲', '郭静', '13800010028', 0, 1),

-- 15
(15, '父亲', '郭伟', '13800010029', 1, 1),
(15, '母亲', '马丽', '13800010030', 0, 1),

-- 16
(16, '父亲', '何志强', '13800010031', 1, 1),
(16, '母亲', '梁敏', '13800010032', 0, 1),

-- 17
(17, '父亲', '高峰', '13800010033', 1, 1),
(17, '母亲', '谢婷', '13800010034', 0, 1),

-- 18
(18, '父亲', '梁勇', '13800010035', 1, 1),
(18, '母亲', '罗雪', '13800010036', 0, 1),

-- 19
(19, '父亲', '谢军', '13800010037', 1, 1),
(19, '母亲', '陈芳', '13800010038', 0, 1),

-- 20
(20, '父亲', '马强', '13800010039', 1, 1),
(20, '母亲', '王艳', '13800010040', 0, 1);